---
kind: other
id: Properties.T:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions
source: html/5cb29166-96de-c18d-b68b-41d417887a56.htm
---
# PromptForFamilyInstancePlacementOptions Properties

The placement type to be used if prompting to place an instance of a face-based family.
 This option is ignored if placing a non-face-based family. If placing a face-based family, Default is an acceptable value, but will correspond to the first available selection in the user interface.